In [30]:
import pandas as pd
df = pd.read_csv('salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [31]:
inputs = df.drop('salary_more_then_100k',axis='columns')
target = df['salary_more_then_100k']

In [32]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [33]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [34]:
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [35]:
input_n = inputs.drop(['company','job','degree'],axis='columns')

In [36]:
input_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [42]:
from sklearn import tree
model = tree.DecisionTreeClassifier()
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(input_n, target, test_size=0.2, random_state=42)

In [43]:
x_train

    company_n  job_n  degree_n
5           2      1         1
12          1      0         0
6           0      2         1
0           2      2         0
10          1      2         0
11          1      2         1
9           0      0         1
14          1      1         0
1           2      2         1
8           0      0         0
7           0      1         0
15          1      1         1

In [44]:
y_train

5     1
12    1
6     0
0     0
10    1
11    1
9     1
14    1
1     0
8     0
7     0
15    1
Name: salary_more_then_100k, dtype: int64

model.fit(x_train, y_train)

In [48]:
predictions = model.predict(x_test)

In [49]:
predictions

array([0, 0, 0, 1], dtype=int64)

In [50]:
accuracy = model.score(x_test,y_test)
accuracy

0.75